BaseConfiguration/Money_2_0/InformationRegisters/ПакетыСинхронизацииКОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПакетыСинхронизацииКОтправке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеПакета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПакета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПакетовСинхронизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегоЧастей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелКорреспондента</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияАвтономныхКопий</v8:Type>
						<v8:Type>cfg:ExchangePlanRef.МобильноеПриложение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПакетаКОтправке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЧастиПакета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ПакетыСинхронизацииКОтправке/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//

#Область ПрограммныйИнтерфейс

// Возвращает таблицу значений с записями, содержащими не отправленные данные для указанного узла
//
//Параметры:
//	Узел - ПланОбменаСсылка
//
//Возвращаемое значение:
//	Массив структур
//
Функция ОчередьПакетовДляУзла(Узел, НомерПакета = Неопределено, ДляСериализации = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Узел", Узел);
	Запрос.УстановитьПараметр("НомерПакета", ?(ЗначениеЗаполнено(НомерПакета), НомерПакета, Неопределено));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПакетыСинхронизацииКОтправке.УзелКорреспондента КАК УзелКорреспондента,
	|	ПакетыСинхронизацииКОтправке.УзелКорреспондента.Код КАК КодУзла,
	|	ПакетыСинхронизацииКОтправке.НомерПакетаКОтправке КАК НомерПакетаКОтправке,
	|	ПакетыСинхронизацииКОтправке.НомерЧастиПакета КАК НомерЧастиПакета,
	|	ПакетыСинхронизацииКОтправке.ВсегоЧастей КАК ВсегоЧастей,
	|	ПакетыСинхронизацииКОтправке.Отправлено КАК Отправлено,
	|	ПакетыСинхронизацииКОтправке.ДатаВыгрузки КАК ДатаВыгрузки,
	|	ПакетыСинхронизацииКОтправке.ТипПакета КАК ТипПакета
	|ИЗ
	|	РегистрСведений.ПакетыСинхронизацииКОтправке КАК ПакетыСинхронизацииКОтправке
	|ГДЕ
	|	ПакетыСинхронизацииКОтправке.УзелКорреспондента = &Узел
	|	И (&НомерПакета = НЕОПРЕДЕЛЕНО
	|			ИЛИ ПакетыСинхронизацииКОтправке.НомерПакетаКОтправке <= &НомерПакета)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПакетаКОтправке,
	|	НомерЧастиПакета";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если ДляСериализации Тогда
		Результат.Колонки.Добавить("ДатаВыгрузкиСтрокой");
		Результат.Колонки.Добавить("ТипПакетаСтрокой");
		Для каждого Строка Из Результат Цикл
			Строка.ДатаВыгрузкиСтрокой = Формат(Строка.ДатаВыгрузки, "ДФ=ггггММддЧЧммсс");
			Если ЗначениеЗаполнено(Строка.ТипПакета) Тогда
				Строка.ТипПакетаСтрокой    = ОбщегоНазначения.ИмяЗначенияПеречисления(Строка.ТипПакета);
			КонецЕсли;
		КонецЦикла;
		Результат.Колонки.Удалить("УзелКорреспондента");
		Результат.Колонки.Удалить("ДатаВыгрузки");
		Результат.Колонки.ДатаВыгрузкиСтрокой.Имя = "ДатаВыгрузки";
		Результат.Колонки.Удалить("ТипПакета");
		Результат.Колонки.ТипПакетаСтрокой.Имя = "ТипПакета";
		Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 


// Возвращает структуру с инфорамцией о файлах, отправленных на сервер
//
//Параметры:
//	Узел - ПланОбменаСсылка
//	НомерПакета - Число - значение измерения НомерПакетаКОтправке
//
//Возвращаемое значение:
//	Структура
//		* КоличествоОтправлено  - Число
//		* КоличествоВсего - Число
//		* ОтправленныеЧасти - Массив структур с описанием частей
//		* ОставшиесяЧасти - Массив структур с описанием частей
//
Функция ИнформацияОбОтправленныхПакетах(Узел, НомерПакета) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КоличествоОтправлено", 0); 
	Результат.Вставить("КоличествоВсего", 0); 
	Результат.Вставить("ОтправленныеЧасти", Новый Массив); 
	Результат.Вставить("НеотправленныеЧасти", Новый Массив); 
	
	Набор = РегистрыСведений.ПакетыСинхронизацииКОтправке.СоздатьНаборЗаписей();
	Набор.Отбор.УзелКорреспондента.Установить(Узел);
	Набор.Отбор.НомерПакетаКОтправке.Установить(НомерПакета);
	Набор.Прочитать();
	
	Результат.КоличествоВсего = Набор.Количество();
	Для каждого Запись Из Набор Цикл
		
		СтруктураЗаписи = Новый Структура("НомерПакета,НомерЧастиПакета,ТипПакета,ВсегоЧастей,ДатаВыгрузки");
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Запись);
		СтруктураЗаписи.НомерПакета = Запись.НомерПакетаКОтправке;
		СтруктураЗаписи.ТипПакета   = ОбщегоНазначения.ИмяЗначенияПеречисления(Запись.ТипПакета);
		Если Запись.Отправлено Тогда
			Результат.ОтправленныеЧасти.Добавить(СтруктураЗаписи);
		Иначе
			Результат.НеотправленныеЧасти.Добавить(СтруктураЗаписи);
		КонецЕсли;
		
	КонецЦикла;
	Результат.КоличествоОтправлено = Результат.ОтправленныеЧасти.Количество();
	
	Набор = Неопределено;
	Возврат Результат;
	
КонецФункции 

// Снимает отмети "Отправлено" со всех частей пакета для указанного узла
//
//Параметры:
//	Узел - ПланОбменаСсылка
//	НомерПакета - Число - значение измерения НомерПакетаКОтправке
//
Процедура ОчиститьИнформациюОбОтправке(Узел, НомерПакета) Экспорт
	
	Набор = РегистрыСведений.ПакетыСинхронизацииКОтправке.СоздатьНаборЗаписей();
	Набор.Отбор.УзелКорреспондента.Установить(Узел);
	Набор.Отбор.НомерПакетаКОтправке.Установить(НомерПакета);
	Набор.Прочитать();
	Для каждого Запись Из Набор Цикл
		
		Запись.Отправлено = Ложь;
		
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

// Удаляет записи для указанных узла и номера пакета
//
//Параметры:
//	Узел - ПланОбменаСсылка
//	НомерПакета - Число - значение измерения НомерПакетаКОтправке
//
Процедура УдалитьПакеты(Узел, НомерПакета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Узел", Узел);
	Запрос.УстановитьПараметр("НомерПакета", ?(ЗначениеЗаполнено(НомерПакета), НомерПакета, Неопределено));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПакетыСинхронизацииКОтправке.УзелКорреспондента КАК УзелКорреспондента,
	|	ПакетыСинхронизацииКОтправке.НомерПакетаКОтправке КАК НомерПакетаКОтправке
	|ИЗ
	|	РегистрСведений.ПакетыСинхронизацииКОтправке КАК ПакетыСинхронизацииКОтправке
	|ГДЕ
	|	ПакетыСинхронизацииКОтправке.УзелКорреспондента = &Узел
	|	И (&НомерПакета = НЕОПРЕДЕЛЕНО
	|			ИЛИ ПакетыСинхронизацииКОтправке.НомерПакетаКОтправке <= &НомерПакета)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПакетаКОтправке";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.ПакетыСинхронизацииКОтправке.СоздатьНаборЗаписей();
		Набор.Отбор.УзелКорреспондента.Установить(Выборка.УзелКорреспондента);
		Набор.Отбор.НомерПакетаКОтправке.Установить(Выборка.НомерПакетаКОтправке);
		Набор.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытий



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти

//
#КонецЕсли
